Ракович_В_Ю_70189466/src/Catalogs/Студенты/Студенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Студенты</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ФИО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.Пол</types>
    </type>
  </attributes>
  <attributes>
    <name>Группа</name>
    <type>
      <types>CatalogRef.Группы</types>
    </type>
  </attributes>
  <attributes>
    <name>Контакты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Родители</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОМСПолис</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаЗдоровья</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МедГруппаФизра</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Инвалидность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаИнвалидности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОбучения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГодПоступления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Антропометрия</name>
    <attributes>
      <name>ДатаИзмерения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Рост</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИМТ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МедКарта</name>
    <attributes>
      <name>ДатаСобытия</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипСобытия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОснования</name>
      <type>
        <types>DocumentRef</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Ракович_В_Ю_70189466/src/Catalogs/Студенты/ObjectModule.bsl
// При создании элемента
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    Статус = "Активный";
    ДатаРождения = '20000101';
КонецПроцедуры

// Расчет ИМТ при изменении роста/веса
Процедура АнтропометрияПриИзменении(Элемент)
    Если Элемент.Рост > 0 И Элемент.Вес > 0 Тогда
        Элемент.ИМТ = Элемент.Вес / ((Элемент.Рост/100) * (Элемент.Рост/100));
    КонецЕсли;
КонецПроцедуры

// Определение группы здоровья по ИМТ
Функция ОпределитьГруппуЗдоровьяПоИМТ() Экспорт
    Если Антропометрия.Количество() > 0 Тогда
        ПоследняяЗапись = Антропометрия[Антропометрия.Количество()-1];
        Если ПоследняяЗапись.ИМТ < 18.5 Тогда
            Возврат "II";
        ИначеЕсли ПоследняяЗапись.ИМТ >= 18.5 И ПоследняяЗапись.ИМТ <= 24.9 Тогда
            Возврат "I";
        ИначеЕсли ПоследняяЗапись.ИМТ >= 25 И ПоследняяЗапись.ИМТ <= 29.9 Тогда
            Возврат "II";
        Иначе
            Возврат "III";
        КонецЕсли;
    КонецЕсли;
    Возврат "";
КонецФункции
